app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("avatar", "body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["avatar", nil], ["body", "Hello"], ["created_at", "2014-07-16 05:40:09.929223"], ["title", "Hi"], ["updated_at", "2014-07-16 05:40:09.929223"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "avatar" = ?, "updated_at" = ? WHERE "posts"."id" = 12  [["avatar", "abc.png"], ["updated_at", "2014-07-16 07:12:28.623413"]]